Documents/ESB/ESB_Consumer_0612/003TestSample/SAMPLE_XML_MUST/DebitCard/DC10_CardApprvAddRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://https://www.nextbank.com.tw//xsd/TW/DebitCard/CardApprvAddRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>DebitCard</ServiceDomain>  
      <OperationName>CardApprvAdd</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:CardApprvAddRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>DC10</v11:TxnId>  
        <v11:TxnNo>DC1000001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:CardRec> 
          <v11:AppDate>20141214</v11:AppDate>  
          <v11:IssDate>20141214</v11:IssDate>  
          <v11:TxnSrc>1</v11:TxnSrc>  
          <v11:CardType>0</v11:CardType>  
          <v11:CardNo>0000000000000000</v11:CardNo>  
          <!--Optional:-->  
          <v11:MCardNo>0000000000000000</v11:MCardNo>  
          <v11:CustPermId>A123456789</v11:CustPermId>  
          <v11:CIFNo>1000000123</v11:CIFNo>  
          <!--Optional:-->  
          <v11:CardCustId>0000005</v11:CardCustId>  
          <!--Optional:-->  
          <v11:CardCIFNo>0000005</v11:CardCIFNo>  
          <v11:GrpCode>0000</v11:GrpCode>  
          <v11:CardKind>V1</v11:CardKind>  
          <!--Optional:-->  
          <v11:SrcCode>000000</v11:SrcCode>  
          <v11:EffDateFrom>0515</v11:EffDateFrom>  
          <v11:EffDateTo>0520</v11:EffDateTo>  
          <!--Optional:-->  
          <v11:BrchId>000</v11:BrchId>  
          <v11:AcctNo>1234567890</v11:AcctNo>  
          <v11:CustChnName>王小明</v11:CustChnName>  
          <v11:CustEngName>Peter Wang</v11:CustEngName>  
          <v11:BirthDay>19800101</v11:BirthDay>  
          <v11:RelnCode>1</v11:RelnCode>  
          <v11:DayLmt>100000</v11:DayLmt>  
          <v11:MnthLmt>100000</v11:MnthLmt>  
          <v11:ICCardFlg>Y</v11:ICCardFlg>  
          <v11:EmailAddr>hello@gmail.com</v11:EmailAddr>  
          <v11:MobNo>910110110</v11:MobNo>  
          <v11:SMSFlg>Y</v11:SMSFlg>  
          <v11:EmailFlg>Y</v11:EmailFlg>  
          <v11:PushAppFlg>Y</v11:PushAppFlg>  
          <v11:CashFlg>Y</v11:CashFlg>  
          <v11:HCEFlg>Y</v11:HCEFlg>  
          <v11:SmartPayFlg>Y</v11:SmartPayFlg>  
          <v11:SMSAmt>100000</v11:SMSAmt>  
          <!--Optional:-->  
          <v11:SMSAmtCcy>TWD</v11:SMSAmtCcy>  
          <v11:SMSMinAmt>20000</v11:SMSMinAmt>  
          <!--Optional:-->  
          <v11:SMSMinAmtCcy>TWD</v11:SMSMinAmtCcy>  
          <v11:AddrZip>100</v11:AddrZip>  
          <v11:MailAddr1>台北市松山區</v11:MailAddr1>  
          <v11:MailAddr2>民生東路二段100號</v11:MailAddr2> 
        </v11:CardRec> 
      </v11:ServiceBody> 
    </v11:CardApprvAddRq> 
  </soap:Body> 
</soap:Envelope>
